In [1]:
import pandas as pd

In [13]:
!ls ..

file1.txt  file2.txt  folder2

In [4]:
!pwd

/home/flo/Documents/coding/playground/folder1/folder2

In [5]:
!whoami

flo

In [16]:
df1 = pd.read_csv("../file1.txt")

In [17]:
df2 = pd.read_csv("../file2.txt")

In [33]:
set(df1.columns) == set(df2.columns)

True

In [31]:
pd.concat([df1, df2], )

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [ ]:
df1.append()

In [34]:
df_10 = pd.DataFrame({'A':[1,2,3,4], 'B':[1,2,3,4],})
df_11 = pd.DataFrame({'A':[1,2,3,4], 'C':[1,2,3,4],})

In [39]:
df_10.append(df_11, ignore_index=True)

    A    B    C
0   1  1.0  NaN
1   2  2.0  NaN
2   3  3.0  NaN
3   4  4.0  NaN
4   1  NaN  1.0
5   2  NaN  2.0
6   3  NaN  3.0
7   4  NaN  4.0
8   1  1.0  NaN
9   2  2.0  NaN
10  3  3.0  NaN
11  4  4.0  NaN

In [47]:
df3 = pd.concat([df1, df2], axis=0).reset_index(drop=True)
df3

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4999,HV85198,Arizona,M,Master,847141.75%,63513.0,70.0,1/0/00,Personal Auto,Four-Door Car,185.667213
5000,BS91566,Arizona,F,College,543121.91%,58161.0,68.0,1/0/00,Corporate Auto,Four-Door Car,140.747286
5001,IL40123,Nevada,F,College,568964.41%,83640.0,70.0,1/0/00,Corporate Auto,Two-Door Car,471.050488
5002,MY32149,California,F,Master,368672.38%,0.0,96.0,1/0/00,Personal Auto,Two-Door Car,28.460568
5003,SA91515,California,M,Bachelor,399258.39%,0.0,111.0,1/0/00,Personal Auto,SUV,700.349052

In [52]:
df3 = pd.concat([df1, df2])
df3

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
991,HV85198,Arizona,M,Master,847141.75%,63513.0,70.0,1/0/00,Personal Auto,Four-Door Car,185.667213
992,BS91566,Arizona,F,College,543121.91%,58161.0,68.0,1/0/00,Corporate Auto,Four-Door Car,140.747286
993,IL40123,Nevada,F,College,568964.41%,83640.0,70.0,1/0/00,Corporate Auto,Two-Door Car,471.050488
994,MY32149,California,F,Master,368672.38%,0.0,96.0,1/0/00,Personal Auto,Two-Door Car,28.460568
995,SA91515,California,M,Bachelor,399258.39%,0.0,111.0,1/0/00,Personal Auto,SUV,700.349052

In [55]:
df3.columns = [col.lower().replace(" ", "_") for col in df3.columns]

In [58]:
df3['customer_lifetime_value'].apply(lambda x: x.replace("%", ""))

AttributeError: 'float' object has no attribute 'replace'

In [59]:
import numpy as np

In [60]:
np.NaN == np.NaN

False

In [63]:
df3['st'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [76]:
def state_cl(x):
    
    if not x==x:
        # then i know, that x is NaN
        return x
    else:
        dct_ = {'Washington': 'WA',
               'Arizona':'AZ',
               'Nevada': 'NV',
               'California':'CA',
               'Oregon':'OR',
               'Cali':'CA',
               'AZ':'AZ',
               'WA':'WA'}

        return dct_[x]

state_cl('WA')

'WA'

In [96]:
df3['st'] = df3['st'].apply(state_cl)

In [97]:
df3['st']

0      WA
1      AZ
2      NV
3      CA
4      WA
       ..
991    AZ
992    AZ
993    NV
994    CA
995    CA
Name: st, Length: 5004, dtype: object

In [71]:
import numpy as np

In [74]:
np.NaN == np.NaN

False

In [75]:
7 == 7

True

In [90]:
df3['gender'].unique()

TypeError: unique() takes 1 positional argument but 2 were given

In [98]:
def my_func(x):
    return x**2

In [99]:
my_func(4)

16

In [100]:
lambda x: x**2

In [101]:
my_func

In [102]:
(lambda x: x**2)(4)

16

In [110]:
df3.head()

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,WA,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,AZ,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,NV,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,CA,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,WA,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [152]:
df3['st'].unique()

array(['WA', 'AZ', 'NV', 'CA', 'OR', nan], dtype=object)

In [162]:
pd.DataFrame(100 * df3.isna().sum()/len(df3), columns=['percent nan'])

                           percent nan
customer                     58.693046
st                           58.693046
gender                       61.131095
education                    58.693046
customer_lifetime_value      58.832934
income                       58.693046
monthly_premium_auto         58.693046
number_of_open_complaints    58.693046
policy_type                  58.693046
vehicle_class                58.693046
total_claim_amount           58.693046
region                       58.693046
region_mapped                58.693046
region_st                    58.693046

In [165]:
df4 = df3.dropna(axis=0, how='all')

In [166]:
100 * df4.isna().sum()/len(df4)

customer                     0.000000
st                           0.000000
gender                       5.902274
education                    0.000000
customer_lifetime_value      0.338655
income                       0.000000
monthly_premium_auto         0.000000
number_of_open_complaints    0.000000
policy_type                  0.000000
vehicle_class                0.000000
total_claim_amount           0.000000
region                       0.000000
region_mapped                0.000000
region_st                    0.000000
dtype: float64

In [167]:
df3

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,region,region_mapped,region_st
0,RB50392,WA,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934,west_coast,west_coast,west_coast
1,QZ44356,AZ,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935,midwest,midwest,midwest
2,AI49188,NV,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247,midwest,midwest,midwest
3,WW63253,CA,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344,west_coast,west_coast,west_coast
4,GA49547,WA,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323,west_coast,west_coast,west_coast
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
991,HV85198,AZ,M,Master,847141.75%,63513.0,70.0,1/0/00,Personal Auto,Four-Door Car,185.667213,midwest,midwest,midwest
992,BS91566,AZ,F,College,543121.91%,58161.0,68.0,1/0/00,Corporate Auto,Four-Door Car,140.747286,midwest,midwest,midwest
993,IL40123,NV,F,College,568964.41%,83640.0,70.0,1/0/00,Corporate Auto,Two-Door Car,471.050488,midwest,midwest,midwest
994,MY32149,CA,F,Master,368672.38%,0.0,96.0,1/0/00,Personal Auto,Two-Door Car,28.460568,west_coast,west_coast,west_coast
995,SA91515,CA,M,Bachelor,399258.39%,0.0,111.0,1/0/00,Personal Auto,SUV,700.349052,west_coast,west_coast,west_coast

In [150]:
def state_group(x):
    # checking for NaN. If x is NaN, return x
    if not x==x:
        return x
    
    else:

        dct_ = {'WA':'west_coast',
                'AZ':'midwest',
                'NV': 'midwest',
                'CA':'west_coast',
                'OR':'west_coast',
               }
        
        return dct_[x]

df3['region'] = df3['st'].apply(state_group)

In [153]:
df3[['region', 'st']]

         region  st
0    west_coast  WA
1       midwest  AZ
2       midwest  NV
3    west_coast  CA
4    west_coast  WA
..          ...  ..
991     midwest  AZ
992     midwest  AZ
993     midwest  NV
994  west_coast  CA
995  west_coast  CA

[5004 rows x 2 columns]

In [154]:
df3['region'].unique()

array(['west_coast', 'midwest', None], dtype=object)

In [122]:
df3['region_mapped'] = list(map(state_group, df3['st']))

In [124]:
df3[['region_mapped', 'region', 'st']]

    region_mapped      region  st
0      west_coast  west_coast  WA
1         midwest     midwest  AZ
2         midwest     midwest  NV
3      west_coast  west_coast  CA
4      west_coast  west_coast  WA
..            ...         ...  ..
991       midwest     midwest  AZ
992       midwest     midwest  AZ
993       midwest     midwest  NV
994    west_coast  west_coast  CA
995    west_coast  west_coast  CA

[5004 rows x 3 columns]

In [125]:
!conda list | grep pycountry

pycountry                 20.7.3             pyh9f0ad1d_0    conda-forge
pycountry-convert         0.7.2                    pypi_0    pypi

In [126]:
import pycountry

In [145]:
def state_group(x):
    # checking for NaN. If x is NaN, return x
    if not x==x:
        return x
    else:
        dct_ = {'west_coast':['CA', 'OR', 'WA'],
                'midwest':['AZ', 'NV'],
               }
        
        return [k for k,v in dct_.items() if x in v][0]

In [146]:
dct_ = {'west_coast':['CA', 'OR'],
        'midwest':['AZ', 'NV'],
       }

In [147]:
for k, v in dct_.items():
    if 'AZ' in v:
        print(k)

midwest

In [148]:
df3['region_st'] = df3['st'].apply(state_group)

In [149]:
df3['region_st']

0      west_coast
1         midwest
2         midwest
3      west_coast
4      west_coast
          ...
991       midwest
992       midwest
993       midwest
994    west_coast
995    west_coast
Name: region_st, Length: 5004, dtype: object